bryamzxz/tinylink/sdkconfig.defaults
# WiFi RX path: the biggest single IRAM mover (~15 KiB).
# CONFIG_ESP_WIFI_RX_IRAM_OPT is not set
# FreeRTOS scheduler hot path: moves vTaskSwitchContext / xQueue*
# helpers / xSemaphore* into flash. Safe because we never call them
# from a cache-disabled ISR.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
# RingBuffer helpers: tinylink doesn't have an ISR producer/consumer
# for any RingBuffer.
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
# newlib lock helpers (`__retarget_lock_*`): only need to be in IRAM
# if newlib state is mutated from a cache-disabled ISR, which tinylink
# does not do (no SPI_FLASH_AUTO_SUSPEND, no IRAM_ATTR newlib touch).
# CONFIG_LIBC_LOCKS_PLACE_IN_IRAM is not set

# ---- TLS to control plane ----------------------------------------------------
# tinylink talks ts2021 over TLS to controlplane.tailscale.com. We use
# esp_tls on top of mbedtls and verify against the IDF certificate bundle.
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_ESP_TLS_USE_SECURE_ELEMENT=n
CONFIG_ESP_TLS_INSECURE=n
CONFIG_MBEDTLS_POLY1305_C=y

# ---- App task stacks ---------------------------------------------------------
# Bigger main stack: TLS + Noise IK + JSON construction is much heavier than
# the M1-WG bringup that this replaces. Verified on-device 2026-05-02:
# the boot-time mbedtls cert-chain verification + ECDSA + Noise IK init
# in tinylink_register peaks at ~14 KiB; bumped from 16 K to 24 K to give
# margin. The long-poll task in tinylink.c::tinylink_long_poll_start
# also xTaskCreate's at 24 KiB to absorb the same workload — bug from
# 8 K manifested as random LoadProhibited / Double exception / fake
# heap-corruption asserts.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=24576

# esp_timer dispatch task stack. mbedtls / lwIP timer callbacks (e.g.
# session ticket lifetime, sntp, peer-cert cleanup) routed through here
# blow past the 3584-byte default once TLS to controlplane.tailscale.com
# is up. Observed on first HW boot 2026-05-02: panic with EXCCAUSE 0x1c
# (LoadStoreError) immediately after the control-key fetch path,
# classic stack-overflow corruption. 6144 gives ~2x headroom.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# ---- Production: silent error paths ------------------------------------------
# Asserts still abort (level=1) but don't print the message string + __FILE__
# + __LINE__. Same crash safety, ~10 KiB flash saved across the error-handling
# surface. Re-enable (=2) in a "diag" overlay if field-debugging a panic.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
# ESP_RETURN_ON_ERROR / ESP_GOTO_ON_ERROR drop their format-string parameter
# when CHECKS_SILENT=y. The check still triggers the goto/return; only the
# log line on error is elided.
CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT=y
# Drops the ~7 KiB esp_err_msg_table[] rodata; esp_err_to_name() returns
# "UNKNOWN ERROR" plus the hex code. Operationally readable, just lookup-free.
# CONFIG_ESP_ERR_TO_NAME_LOOKUP is not set
